###
# Essential packages

# Necessary for setting up dotfiles
git
github-cli
sudo
unzip
wget
fish

# x11 packages
xorg
xorg-xinit

# Terminal emulator and compositor
wezterm
picom

# System utilities
brightnessctl
scrot
pamixer

# Audio packages
pipewire
wireplumber
pipewire-audio
pipewire-pulse

# Development tools
neovim
nodejs
npm
python
uv
gcc
fzf
xclip
rofi

# GUI Applications
thunderbird
telegram-desktop
firefox
discord
spotify-launcher

###
# Additional packages

# System monitoring tools
btop
fastfetch
tree

# Networking packages
net-tools
networkmanager
ufw

# File management
xdg-desktop-portal-gtk

# Input methods
fcitx5-im
fcitx5-skk

# Cloud storage
rclone

# Gaming platform
steam

# Document viewer
zathura
zathura-pdf-mupdf

# Media player
mpv

# Font packages
noto-fonts-cjk
noto-fonts-emoji

# Notification daemon
dunst
