###
# Essential packages

# Necessary for setting up dotfiles
git
github-cli
sudo
unzip
wget
fish

# Display server
wayland
xorg-xwayland

# Window manager and related packages
hyprland
hyprpaper
waybar
brightnessctl
playerctl
rofi
dunst
foot
xdg-desktop-portal-hyprland
wl-clipboard
grim
slurp

# Audio packages
pipewire
wireplumber
pipewire-audio
pipewire-pulse

# Development tools
neovim
nodejs
npm
python
gcc
fzf
ripgrep
fd
bat
tree-sitter-cli
eza
zoxide

# GUI Applications
thunderbird
telegram-desktop
firefox
discord
spotify-launcher

# Fonts
otf-monaspace-nerd
ttf-mplus-nerd
adobe-source-han-sans-otc-fonts
noto-fonts-emoji

# Document viewer
zathura
zathura-pdf-mupdf

###
# Additional packages

# System monitoring tools
btop
fastfetch

# Networking packages
net-tools
networkmanager
ufw

# File picker
xdg-desktop-portal-gtk

# Input methods
fcitx5-im
fcitx5-skk

# Cloud storage
rclone

# Gaming platform
steam

# Media player
mpv

